
/* Presented when user typed illegal characters -- No valid object */
"Invalid number" = "Invalid number";

/* Presented when user value smaller than minimum */
"Fell short of minimum" = "Fell short of minimum";

/* Presented when user value larger than maximum */
"Maximum exceeded" = "Maximum exceeded";

/* Presented when value is a float, but floats not allowed */
"Floating Point not allowed" = "Floating Point not allowed";

/* Presented when string cannot be converted to an NSDate */
"Invalid date string" = "Invalid date string";

